Modules/Employee/Http/Controllers/AddCalendController.php

select * from `calends`
---
   public function index()
   {
       $calend = Calend::all();

update `calends` set `discount_percentage` = '848', `calends`.`updated_at` = '2019-07-24 15:22:38' where `id` = 32
---
   public function update(CreateAddCalendRequest $request, $id)
   {
     Calend::findOrfail($id)->update($request->all());