Modules/Employee/Http/Controllers/EvaluationItemController.php

select * from `evaluation_items`
---
    public function index()
    {
        return  EvaluationItemResource::collection(EvaluationItem::all());