Modules/Student/Http/Controllers/PayClassController.php

    public function index()
    {
        $PayClases = PayClass::all();
---
select * from `pay_classes`