app/Helper/helper.php

function getSelect($tableName, $all = null)
{
    // $list = [];
    // $list[0] = ($all) ? '' : $list ;
    switch ($tableName) {
        case 'levels':
            $list = \DB::table('levels')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'classrooms':
            $list = \DB::table('classrooms')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'parts':
            $list = \DB::table('parts')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'identifcations':
            $list = \DB::table('identifcations')->pluck('identifcationable_id', 'id');
            return $list->toArray();
            break;
        case 'students':
            $list = \DB::table('students')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'parts':
            $list = \DB::table('students')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'employees':
            $list = \DB::table('employees')->pluck('full_name', 'id');
            return $list->toArray();
            break;
        case 'pay_ruls':
            $list = \DB::table('pay_ruls')->pluck('name', 'id');
---
select `name`, `id` from `levels`
select `name`, `id` from `classrooms`
select `full_name`, `id` from `employees`
select `name`, `id` from `pay_ruls`

            return $list->toArray();
            break;
        case 'managaments':
            $list = \DB::table('managaments')->pluck('name', 'id');
            return $list->toArray();
            break;
        case 'departments':
            $list = \DB::table('departments')->pluck('name', 'id');
---
select `name`, `id` from `managaments`
select `name`, `id` from `departments`

            return $list->toArray();
            break;
        case 'calends':
            $list = \DB::table('calends')->pluck('name', 'id');
---
select `name`, `id` from `calends`